Repository: Richasy/WinUI.Share
Catalog: src/WinUIKernel.AI/Resources/*/Resources.resw
Source language: en_us
Languages: zh_cn, zh_hant_cn

source: Access key
zh_cn: 访问密钥
zh_hant_cn: 訪問密鑰

# AccessKeyDescription
source: Fill in the API key from {0}
zh_cn: 填入来自 {0} 的 API 密钥
zh_hant_cn: 填入來自 {0} 的 API 金鑰

# AccessKeyPlaceholder
source: {0} API key
zh_cn: {0} API 密钥
zh_hant_cn: {0} API 金鑰

# AccessKeyPlaceholderText
source: Key for accessing the service
zh_cn: 访问服务的密钥
zh_hant_cn: 訪問服務的密鑰

# AccessKeySecret
source: Access secret
zh_cn: 访问密文（AccessKey Secret）
zh_hant_cn: 訪問密文（AccessKey Secret）

# AddYourCustomModel
source: Add a custom model
zh_cn: 添加自定义模型
zh_hant_cn: 新增自訂模型

# AliAccessKeySecretDescription
source: Register in Alibaba Cloud and get the Secret
zh_cn: 在阿里云中注册并获取 Secret
zh_hant_cn: 在阿里雲中註冊並獲取 Secret

# AliTranslateAccessKeyDescription
source: Register in Alibaba Cloud and get the Key
zh_cn: 在阿里云中注册并获取密钥
zh_hant_cn: 在阿里雲中註冊並獲取密鑰

source: API key
zh_cn: API 密钥（API Key）
zh_hant_cn: API 金鑰（API Key）

source: App ID
zh_cn: 应用 ID
zh_hant_cn: 應用程式 ID

# AzureOpenAIAccessKeyDescription
source: Find this value in "Keys and Endpoints" of the corresponding resource in the Azure portal. You can use KEY1 or KEY2
zh_cn: 在 Azure 门户相应资源的 "密钥与终结点" 中找到此值，可用 KEY1 或 KEY2
zh_hant_cn: 在 Azure 入口網站對應資源的 "金鑰與終結點" 中找到此值，可用 KEY1 或 KEY2

# AzureOpenAIEndpointDescription
source: Find this value in "Keys and Endpoints" of the corresponding resource in the Azure portal
zh_cn: 在 Azure 门户相应资源的 "密钥与终结点" 中找到此值
zh_hant_cn: 在 Azure 入口網站對應資源的 "金鑰與終結點" 中找到此值

# AzureRegionDescription
source: Find this value in "Keys and Endpoints" of the corresponding resource in the Azure portal
zh_cn: 在 Azure 门户相应资源的 "密钥与终结点" 中找到此值
zh_hant_cn: 在 Azure 入口網站對應資源的 "金鑰與終結點" 中找到此值

# AzureSpeechAccessKeyDescription
source: Find this value in "Keys and Endpoints" of the corresponding resource in the Azure portal. You can use KEY1 or KEY2
zh_cn: 在 Azure 门户相应资源的 "密钥与终结点" 中找到此值，可用 KEY1 或 KEY2
zh_hant_cn: 在 Azure 入口網站對應資源的 "金鑰與終結點" 中找到此值，可用 KEY1 或 KEY2

# AzureTranslateAccessKeyDescription
source: Find this value in "Keys and Endpoints" of the corresponding resource in the Azure portal. You can use KEY1 or KEY2
zh_cn: 在 Azure 门户相应资源的 "密钥与终结点" 中找到此值，可用 KEY1 或 KEY2
zh_hant_cn: 在 Azure 入口網站對應資源的 "金鑰與終結點" 中找到此值，可用 KEY1 或 KEY2

# BaiduAppIdDescription
source: Register in Baidu Translate Open Platform and get the App ID
zh_cn: 在百度翻译开放平台中注册并获取 App ID
zh_hant_cn: 在百度翻譯開放平台中註冊並取得 App ID

source: Cancel
zh_cn: 取消
zh_hant_cn: 取消

# ChatModelIdPlaceholder
source: Such as "gpt-4"
zh_cn: 如 "gpt-4"
zh_hant_cn: 如 "gpt-4"

# ChatModelNamePlaceholder
source: Such as "ChatGPT 4"
zh_cn: 如 "ChatGPT 4"
zh_hant_cn: 如 "ChatGPT 4"

source: Codestral key
zh_hant_cn: Codestral 密鑰

# CodestralKeyDescription
source: Enter a unique key for Codestral
zh_hant_cn: 輸入專屬於 Codestral 的金鑰

source: Confirm
zh_cn: 确认
zh_hant_cn: 確認

source: Create
zh_cn: 创建
zh_hant_cn: 創建

source: Create custom model
zh_cn: 创建自定义模型
zh_hant_cn: 建立自訂模型

source: Custom model
zh_cn: 自定义模型
zh_hant_cn: 自訂模型

source: Delete
zh_cn: 删除
zh_hant_cn: 刪除

source: Edit
zh_cn: 编辑
zh_hant_cn: 編輯

source: Endpoint
zh_cn: 终结点
zh_hant_cn: 終結點

# EndpointDescription
source: Must include http(s)://
zh_cn: 必须包含 http(s)://
zh_hant_cn: 必須包含 http(s)://

# EndpointPlaceholder
source: like https://api.openai.com/v1
zh_cn: 如 https://api.openai.com/v1
zh_hant_cn: 如 https://api.openai.com/v1

# ErnieSecretDescription
source: Get Secret Key from "Application Access" of Baidu Qianfan LLM Platform
zh_cn: 从百度千帆大模型平台的 "应用接入" 中获取 Secret Key
zh_hant_cn: 從百度千帆大模型平台的 "應用程式接入" 中取得 Secret Key

# HunyuanSecretIdDescription
source: Get SecretId in "API Key Management"
zh_cn: 在 "API密钥管理" 中获取 SecretId
zh_hant_cn: 在 "API金鑰管理" 中取得 SecretId

# HunyuanSecretKeyDescription
source: Get when creating SecretKey in "API Key Management"
zh_cn: 在 "API密钥管理" 中创建 SecretKey 时获取
zh_hant_cn: 在 "API金鑰管理" 中建立 SecretKey 時獲取

source: Key ID
zh_cn: 密钥 ID
zh_hant_cn: 密鑰 ID

# ModelAlreadyExist
source: Model already exists
zh_cn: 模型已存在
zh_hant_cn: 模型已存在

source: Model ID
zh_cn: 模型 ID
zh_hant_cn: 模型 ID

# ModelIdDescription
source: Model ID is the real identification name of the model, and AI service identifies the model through this identification
zh_cn: 模型 ID 是该模型的真实标识名称，AI 服务通过此标识确定模型
zh_hant_cn: 模型 ID 是該模型的真實識別名稱，AI 服務透過此標識確定模型

source: Model name
zh_cn: 模型名称
zh_hant_cn: 模型名稱

# ModelNameDescription
source: Model name is the readable name displayed on the UI
zh_cn: 模型名称是应用内部显示在界面上的可读名称
zh_hant_cn: 模型名稱是應用程式內部顯示在介面上的可讀名稱

source: Model name or ID cannot be empty
zh_cn: 模型名称或ID不能为空
zh_hant_cn: 模型名稱或ID不能為空

# ModifyCustomModel
source: Edit custom model
zh_cn: 编辑自定义模型
zh_hant_cn: 編輯自訂模型

source: More options
zh_cn: 更多选项
zh_hant_cn: 更多選項

# OptionalPlaceholder
source: If there is no, leave it blank
zh_cn: 如果没有则不填
zh_hant_cn: 如果沒有則不填

source: Organization (optional)
zh_cn: 组织（可选）
zh_hant_cn: 組織（可選）

# PredefinedModels
source: Predefined model
zh_cn: 预定义模型
zh_hant_cn: 内建模型

# PredefinedModelsDescription
source: View the list of built-in models of {0}
zh_cn: 查看 {0} 的内置模型列表
zh_hant_cn: 查看 {0} 的內建模型列表

# Region
source: Location/Region
zh_cn: 位置/区域
zh_hant_cn: 位置/區域

# RegionPlaceholderText
source: Service location
zh_cn: 服务所在地区
zh_hant_cn: 服務所在地區

source: Secret ID
zh_cn: 密文 ID（Secret ID）
zh_hant_cn: 密文 ID（Secret ID）

source: Secret Key
zh_cn: 密文密钥（Secret Key）
zh_hant_cn: 密文金鑰（Secret Key）

# SeeAllPredefinedModels
source: View all predefined models
zh_cn: 查看全部预定义模型
zh_hant_cn: 看全部内建模型

# SparkAppIdDescription
source: Register the application in iFlytek Open Platform and obtain App ID
zh_cn: 在讯飞开放平台中注册应用并获取 App ID
zh_hant_cn: 在訊飛開放平台中註冊應用程式並取得 App ID

# SparkSecretDescription
source: Register the application in iFlytek Open Platform and obtain Secret
zh_cn: 在讯飞开放平台中注册应用并获取 Secret
zh_hant_cn: 在訊飛開放平台中註冊應用程式並取得 Secret

# TencentSecretIdDescription
source: Get SecretId in "API Key Management"
zh_cn: 在 "API密钥管理" 中获取 SecretId
zh_hant_cn: 在 "API金鑰管理" 中取得 SecretId

# TencentSecretKeyDescription
source: Get it when creating SecretKey in "API Key Management"
zh_cn: 在 "API密钥管理" 中创建 SecretKey 时获取
zh_hant_cn: 在 "API金鑰管理" 中建立 SecretKey 時獲取

source: Use Codestral
zh_hant_cn: 使用 Codestral

# UseCodestralDescription
source: Use Codestral API and its models
zh_hant_cn: 使用 Codestral API 及其模型

# VolcanoKeyIdDescription
source: Get Access Key ID in "API Access Key" of Volcano Engine
zh_cn: 在火山引擎的 "API访问密钥" 中获取 Access Key ID
zh_hant_cn: 在火山引擎的 "API訪問金鑰" 中取得 Access Key ID

# VolcanoSecretKeyDescription
source: Get Secret Access Key in "API Access Key" of Volcano Engine
zh_cn: 在火山引擎的 "API访问密钥" 中获取 Secret Access Key
zh_hant_cn: 在火山引擎的 "API訪問金鑰" 中取得 Secret Access Key

# YoudaoAppIdDescription
source: Register and get App ID in Youdao Open Platform
zh_cn: 在有道开放平台中注册并获取 App ID
zh_hant_cn: 在有道開放平台中註冊並取得 App ID
